Revit 2027 API
Connector.Demand Property
The demand of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Demand { get; }
Public ReadOnly Property Demand As Double
	Get
public:
property double Demand {
	double get ();
}
member Demand : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's domain is not DomainPiping.
InvalidOperationException |  Thrown on failure to get demand.
Remarks
Instantaneous demand at this connector, calculated according to system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace